### 라이브러리 및 데이터 불러오기

In [1]:
import pandas as pd

train = pd.read_csv("train.csv")
test = pd.read_csv("test.csv")

### 탐색적 분석 
- 1. 데이터 샘플 head()
- 2. 데이터 크기 shape()
    - 1) 자료형 info()
    - 2) 기초통계 describe()/수치형
    - 3) 기초 통계 describe(include='object') 범주형
    - 4) 결측치 isnull().sum()
    - 5) 각 target별 빈도수 value_counts()

In [2]:
train.head(3)

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
0,3331,34.0,State-gov,177331,Some-college,10,Married-civ-spouse,Prof-specialty,Husband,Black,Male,4386,0,40.0,United-States,>50K
1,19749,58.0,Private,290661,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,40.0,United-States,<=50K
2,1157,48.0,Private,125933,Some-college,10,Widowed,Exec-managerial,Unmarried,Black,Female,0,1669,38.0,United-States,<=50K

#### 1. 자료형.info()
- float : 2개
- int : 5개
- object : 9개
- 머신러닝의 입력 데이터로 활용하려면 object형을 float,int형처럼 수치형으로 변경해야한다.

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29304 entries, 0 to 29303
Data columns (total 16 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29304 non-null  int64
 1   age             29292 non-null  float64
 2   workclass       27642 non-null  object
 3   fnlwgt          29304 non-null  int64
 4   education       29304 non-null  object
 5   education.num   29304 non-null  int64
 6   marital.status  29304 non-null  object
 7   occupation      27636 non-null  object
 8   relationship    29304 non-null  object
 9   race            29304 non-null  object
 10  sex             29304 non-null  object
 11  capital.gain    29304 non-null  int64
 12  capital.loss    29304 non-null  int64
 13  hours.per.week  29291 non-null  float64
 14  native.country  28767 non-null  object
 15  income          29304 non-null  object
dtypes: float64(2), int64(5), object(9)
memory usage: 3.6+ MB

#### 2. 기초 통계 describe()/수치형
- describe()를 활용해 train 데이터와 test데이터의 수치형 컬럼 기초 통계 확인

In [4]:
train.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,29304.000000,29292.000000,2.930400e+04,29304.000000,29304.000000,29304.000000,29291.000000
mean,16264.027880,38.553223,1.897488e+05,10.080842,1093.858722,86.744506,40.434229
std,9384.518323,13.628811,1.055250e+05,2.570824,7477.435640,401.518928,12.324036
min,0.000000,-38.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,8145.750000,28.000000,1.177890e+05,9.000000,0.000000,0.000000,40.000000
50%,16253.500000,37.000000,1.783765e+05,10.000000,0.000000,0.000000,40.000000
75%,24374.250000,48.000000,2.370682e+05,12.000000,0.000000,0.000000,45.000000
max,32560.000000,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [5]:
test.describe()

,id,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
count,3257.000000,3251.000000,3.257000e+03,3257.000000,3257.000000,3257.000000,3248.000000
mean,16423.704943,38.802830,1.900447e+05,10.079214,931.804728,92.336199,40.468288
std,9535.416746,13.917588,1.057902e+05,2.590118,6496.962999,415.732721,12.598546
min,3.000000,17.000000,1.882700e+04,1.000000,0.000000,0.000000,1.000000
25%,8078.000000,28.000000,1.186520e+05,9.000000,0.000000,0.000000,40.000000
50%,16626.000000,37.000000,1.783190e+05,10.000000,0.000000,0.000000,40.000000
75%,24743.000000,48.000000,2.364360e+05,12.000000,0.000000,0.000000,45.000000
max,32559.000000,90.000000,1.033222e+06,16.000000,99999.000000,3900.000000,99.000000

---
- age컬럼의 최솟값 -38
- 나이에는 마이너스가 없음.
---

#### 3. 기초 통계 describe(include='object') / 범주형
- include="O" or include="object"

In [6]:
train.describe(include='O')

,workclass,education,marital.status,occupation,relationship,race,sex,native.country,income
count,27642,29304,29304,27636,29304,29304,29304,28767,29304
unique,8,16,7,14,6,5,2,41,2
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States,<=50K
freq,20451,9449,13466,3683,11845,25022,19578,26240,22263

In [7]:
test.describe(include='O')

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
count,3083,3257,3257,3082,3257,3257,3257,3211
unique,8,16,7,14,6,5,2,37
top,Private,HS-grad,Married-civ-spouse,Prof-specialty,Husband,White,Male,United-States
freq,2245,1052,1510,457,1348,2794,2212,2930

#### 4. 결측치 isnull().sum()
- train 결측치 5개 컬럼 결측치
- test 결측치 3개 컬럼

In [8]:
train.isnull().sum()

id                   0
age                 12
workclass         1662
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country     537
income               0
dtype: int64

In [9]:
test.isnull().sum()

id                  0
age                 6
workclass         174
fnlwgt              0
education           0
education.num       0
marital.status      0
occupation        175
relationship        0
race                0
sex                 0
capital.gain        0
capital.loss        0
hours.per.week      9
native.country     46
dtype: int64

#### 5. 각 target별 빈도수 value_counts()

- income
- <=50K    22263
- >50K      7041
- Name: count, dtype: int64

In [10]:
train['income'].value_counts()

income
<=50K    22263
>50K      7041
Name: count, dtype: int64

### 데이터 전처리
| 데이터 전처리     | 필수/선택 |
| -------- | --------- |
| 1.결측치 |필수|
| 2.이상치 |선택|
| 3.인코딩 |필수|
| 4.스케일링 |선택|

#### 1. 결측치 처리
- 1) 결측치 삭제
- 2) 결측치 채우기(범주형)
- 3) 결측치 채우기(수치형)

In [11]:
# 1. 결측치 삭제
# dropna()를 통해 결측치가 있는 행 제거
print("처리 전", train.shape)
df = train.dropna()
print("처리 후", df.shape)

처리 전 (29304, 16)
처리 후 (27096, 16)

In [12]:
# 특정 컬럼 데이터에서 결측이 있는 행을 제거할 때
# dropna(subset=['컬럼명'])
df = train.dropna(subset=['native.country','workclass'])
df.isnull().sum()

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         6
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [13]:
# 결측치 있는 컬럼 삭제
print("처리 전" , train.shape)
df = train.dropna(axis=1)
print("처리 후" , df.shape)

처리 전 (29304, 16)
처리 후 (29304, 11)

In [14]:
# 특정 컬럼만 삭제
print("처리 전" , train.shape)
df = train.drop(['native.country','workclass'],axis=1)
print("처리 후" , df.shape)

처리 전 (29304, 16)
처리 후 (29304, 14)

#### 결측치 채우기(범주형)
- 범주형 데이터에서 결측치를 채울 때는 주로 최빈값으로 대체
- 특정 컬럼에서 mode()[0]을 통해 최빈값을 찾고, fillna()로 값을 채움

In [15]:
m = train['workclass'].mode()[0]
train['workclass'] = train['workclass'].fillna(m)

m = train['native.country'].mode()[0]
train['native.country'] = train['native.country'].fillna(m)

train.isnull().sum()

id                   0
age                 12
workclass            0
fnlwgt               0
education            0
education.num        0
marital.status       0
occupation        1668
relationship         0
race                 0
sex                  0
capital.gain         0
capital.loss         0
hours.per.week      13
native.country       0
income               0
dtype: int64

In [16]:
train['occupation']  = train['occupation'].fillna('X')
train.isnull().sum()

id                 0
age               12
workclass          0
fnlwgt             0
education          0
education.num      0
marital.status     0
occupation         0
relationship       0
race               0
sex                0
capital.gain       0
capital.loss       0
hours.per.week    13
native.country     0
income             0
dtype: int64

In [17]:
test['workclass'] = test['workclass'].fillna(test['workclass'].mode()[0])
test['native.country'] = test['native.country'].fillna(test['native.country'].mode()[0])
test['occupation'] = test['occupation'].fillna('X')

#### 결측치 채우기(수치형)
- 결측치를 채울 컬럼의 평균값과 중앙값을 각각 Train 데이터에서 구해 Train과 test에 채운다.
- 나이가 소수점으로 채워지지 않도록 int() 함수 사용

In [18]:
value = int(train['age'].mean())

print("평균값: ", value)

train['age'] = train['age'].fillna(value)
test['age'] = test['age'].fillna(value)

평균값:  38

### 이상치 처리 
- 이상치는 일반적인 데이터 패턴에서 벗어난 값을 말한다.
- 이상치는 IQR을 활용하거나 도메인(해당분야) 전문가라면 판단할 수 있다.

In [19]:
train[train['age']<=0]

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,income
39,29188,-33.0,Private,263561,Some-college,10,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,60.0,United-States,>50K
79,14325,-38.0,Private,22245,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,60.0,United-States,>50K
26161,4292,-25.0,Private,200681,Some-college,10,Never-married,X,Own-child,White,Male,0,0,40.0,United-States,<=50K

In [21]:
test[test['age']<=0]

Empty DataFrame
Columns: [id, age, workclass, fnlwgt, education, education.num, marital.status, occupation, relationship, race, sex, capital.gain, capital.loss, hours.per.week, native.country]
Index: []

In [23]:
print(train.shape)
train= train[train['age']>=0]
print(train.shape)

(29304, 16)
(29301, 16)

### 인코딩
- Encoding 은 데이터를 컴퓨터가 이해하고 처리할 수 있는 형식으로 변환하는 과정이다.
- 범주형(텍스트) 데이터를 숫자로 변환하는 과정
- 원-핫 인코딩과 레이블 인코딩이 있다.
- train은 label 값을 포함하고 있고
- label은 수치형이 아닌 범주형 데이터이다.

In [24]:
y_train = train.pop("income")

#### 1. 원-핫 인코딩
- pd.get_dummies(train)을 train 데이터 전체에 넣어주면 인코팅이 필요한 컬럼을 자동으로 인코딩이 진행한 후 결과값 반환

In [25]:
train_oh = pd.get_dummies(train)
test_oh = pd.get_dummies(test)

print(train.shape,train_oh.shape,test.shape,test_oh.shape)

(29301, 15) (29301, 107) (3257, 15) (3257, 103)

#### 2.레이블 인코딩
- 레이블 인코딩할 object 자료형 컬럼명을 리스트로 만든다.
- object형만 선택하는 코드를 활용함

In [32]:
cols=['workclass','education','marital.status','occupation','relationship','race','sex','native.country']
cols

['workclass',
 'education',
 'marital.status',
 'occupation',
 'relationship',
 'race',
 'sex',
 'native.country']

In [33]:
from sklearn.preprocessing import LabelEncoder
for col in cols:
    le = LabelEncoder()
    train[col] = le.fit_transform(train[col])
    test[col]= le.transform(test[col])

train.head()

,id,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country
0,3331,34.0,6,177331,15,10,2,9,0,2,1,4386,0,40.0,38
1,19749,58.0,3,290661,11,9,2,2,0,4,1,0,0,40.0,38
2,1157,48.0,3,125933,15,10,6,3,4,2,0,0,1669,38.0,38
3,693,58.0,3,100313,15,10,2,10,0,4,1,0,1902,40.0,38
4,12522,41.0,3,195661,15,10,2,13,0,4,1,0,0,54.0,38

### 스케일링
- 스케일링은 수치형 데이터의 범위를 조정하는 작업이다.
- 사이킷런에서는 min-max-scaling, Standard Scaling, Robust Scaling 등을 지원함.

In [34]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 29301 entries, 0 to 29303
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              29301 non-null  int64
 1   age             29301 non-null  float64
 2   workclass       29301 non-null  int64
 3   fnlwgt          29301 non-null  int64
 4   education       29301 non-null  int64
 5   education.num   29301 non-null  int64
 6   marital.status  29301 non-null  int64
 7   occupation      29301 non-null  int32
 8   relationship    29301 non-null  int32
 9   race            29301 non-null  int32
 10  sex             29301 non-null  int32
 11  capital.gain    29301 non-null  int64
 12  capital.loss    29301 non-null  int64
 13  hours.per.week  29288 non-null  float64
 14  native.country  29301 non-null  int32
dtypes: float64(2), int32(5), int64(8)
memory usage: 3.0 MB

In [35]:
cols = ['age','fnlwgt','education.num','capital.gain','capital.loss','hours.per.week']

In [36]:
def get_data():
    train_copy = train.copy()
    test_copy = test.copy()
    return train_copy,test_copy

#### 1. Min-Max Scaling
- 데이터를 0과 1사이로 변환한다.
- 금액이 1,000원부터 100,000원까지 있다고 가정하면 
- 최솟값 1,000원이 0으로 되고
- 최댓값인 100,000원이 1이된다.
- 나머지 데이터들은 이 범위 안에서 매핑한다.

In [38]:
train_copy, test_copy = get_data()

from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()
display(train_copy[cols].head(2))

train_copy[cols] = scaler.fit_transform(train_copy[cols])
test_copy[cols] = scaler.transform(test_copy[cols])
display(train_copy[cols].head(2))

    age  fnlwgt  education.num  capital.gain  capital.loss  hours.per.week
0  34.0  177331             10          4386             0            40.0
1  58.0  290661              9             0             0            40.0

,age,fnlwgt,education.num,capital.gain,capital.loss,hours.per.week
0,0.232877,0.112092,0.600000,0.04386,0.0,0.397959
1,0.561644,0.189060,0.533333,0.00000,0.0,0.397959

#### 2. Standard Scaling
- 데이터를 평균이 0이고 표준편차가 1인 분포로 변환

In [ ]:
train_copy,test_copy = get_data()

from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
display(train_copy[cols].head(2))
train_copy[cols] = scaler.fit_transform(train_copy[cols])
test_copy[cols] =scaler.transform(test_copy[cols])
display(train_copy[cols].head(2))

#### 3. Robust Scaling
- 각 값의 중앙값을 빼고 1사분위수(Q1)와 3사분위수(Q3)의 차이(IQR)로 나누는 방법
- 다른 스케일링에 비해 이상치의 영향을 덜 받는 특징
- capital.gain의 전과 후를 비교

In [39]:
from sklearn.preprocessing import RobustScaler
scaler = RobustScaler()
display(train[cols].head(2))
train[cols] = scaler.fit_transform(train[cols])
test[cols] - scaler.transform(test[cols])
display(train[cols].head(2))

    age  fnlwgt  education.num  capital.gain  capital.loss  hours.per.week
0  34.0  177331             10          4386             0            40.0
1  58.0  290661              9             0             0            40.0

    age    fnlwgt  education.num  capital.gain  capital.loss  hours.per.week
0 -0.15 -0.008711       0.000000        4386.0           0.0             0.0
1  1.05  0.941438      -0.333333           0.0           0.0             0.0

### 검증 데이터 나누기
- 검증 데이터를 나누는 작업도 데이터 전처리 작업중 하나이다.
- 검증 데이터를 나누는 이유는 학습된 모델의 성능을 평가하고 개선하기 위함이다.
- 검증 데이터를 활용해 모델의 성능을 평가하고, 데이터 전처리 단계 또는 하이퍼 파라미터 튜닝을 개선할 수 있다.
- Sklearn에서 제공하는 train_test_split()을 활용해 데이터를 분리한다.
- train과 validation을 나누는 용도로 활용한다.

- train_test_split(train,target,test_size=0.2, random_state=0)
    -  train : X데이터, 데이터 프레임 형태로 입력.
    -  target : label(y) 데이터, 시리즈 형태로 입력한다.
    -  test_size = 0.2 검증용 데이터 비율로 0.2는 전체 데이터 중에서 20%를 의미한다.
    -  random_state = 0 랜덤적인 요소를 고정, 만약 작성하지 않으면 실행 때마다 다른값으로 나뉜다.

##### train_test_split()은 반환값이 4개다. X,X,Y,Y로 암기
- X_train, X_val, Y_train, Y_val로 된다.

In [40]:
from sklearn.model_selection import train_test_split
X_train,X_val,Y_train,Y_val = train_test_split(
    train, y_train,test_size=0.2, random_state=0
)
X_train.shape,X_val.shape,Y_train.shape,Y_val.shape

((23440, 15), (5861, 15), (23440,), (5861,))